; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph0 - mode
	image4 - mode
	image1 - mode
	thermograph2 - mode
	thermograph3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star10 - direction
	GroundStation13 - direction
	Star14 - direction
	GroundStation9 - direction
	Star8 - direction
	Star0 - direction
	Star11 - direction
	Star7 - direction
	Star12 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star11)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph0)
	(supports instrument2 image4)
	(calibration_target instrument2 Star11)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph3)
	(have_image Star17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 thermograph0)
	(have_image Planet20 thermograph2)
	(have_image Planet21 image4)
))

)

; plan
1. (turn_to satellite2 star11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star11)
   goals met: 0 of 7
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite2 instrument2 star11)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite2 planet18 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet18)
   goals met: 0 of 7
5. (take_image satellite2 planet18 instrument2 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite2 planet15 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet15)
   goals met: 1 of 7
7. (turn_to satellite1 star0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star0)
   goals met: 1 of 7
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
9. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 7
10. (take_image satellite2 planet15 instrument2 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 7
11. (turn_to satellite1 phenomenon16 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 7
12. (take_image satellite1 phenomenon16 instrument1 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 3 of 7
13. (turn_to satellite1 planet19 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet19)
   goals met: 3 of 7
14. (take_image satellite1 planet19 instrument1 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 4 of 7
15. (turn_to satellite1 star17 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 star17)
   goals met: 4 of 7
16. (take_image satellite1 star17 instrument1 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 5 of 7
17. (turn_to satellite2 planet20 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet20)
   goals met: 5 of 7
18. (take_image satellite2 planet20 instrument2 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 6 of 7
19. (turn_to satellite2 planet21 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet21)
   goals met: 6 of 7
20. (take_image satellite2 planet21 instrument2 image4)
   added: (have_image planet21 image4)
   goals met: 7 of 7
